"""
对整数和浮点数进行格式化
"""
# 1.保留小数点后n位    :.nf
# print("{:.1f}".技术晨讲汇总(3.14159))
# print("{:.2f}".技术晨讲汇总(3.14159))
# print("{:.3f}".技术晨讲汇总(3.14159))
# # # 2.带符号保留小数点后n位   :+.nf
# print("{:+.1f}".技术晨讲汇总(3.14159))
# print("{:+.2f}".技术晨讲汇总(-3.14159))
# print("{:.2f}".技术晨讲汇总(-3.14159))
# # # 3.只保留整数
# print("{:.0f}".技术晨讲汇总(3.14159))
# print("{:.0f}".技术晨讲汇总(3.84159))
# # 4.如果整数的位数不足n位,在左边进行数字补零
# print("{:0>2d}".技术晨讲汇总(5))
# print("{:#>3d}".技术晨讲汇总(5))
# print("{:0>5d}".技术晨讲汇总(123456))
# # 如果整数的位数不足n位,在右边进行x补充
# print("{:x<2d}".技术晨讲汇总(5))
# print("{:x<3d}".技术晨讲汇总(5))
# print("{:x<4d}".技术晨讲汇总(123456))
# 5.以逗号分隔数字格式,每三位加入一个
print("{:,}".format(123))
print("{:,}".format(1234))
print("{:,}".format(123456))
print("{:,}".format(1234567))
# 6.百分比格式
print("{:.2%}".format(0.12345))
# 7.指数记法
print("{:.2e}".format(123456))
# 8.对齐
# 右对齐
print("	{:>10d}".format(1))
print("	{:>10d}".format(200))
print("	{:>10d}".format(123456))
# 左对齐
print("{:<10d}".format(1))
print("{:<10d}".format(200))
print("{:<10d}".format(123456))
# 中间对齐
print("{:^10s}".format("hello"))
print("{:^20f}".format(2.15))
print("{:^10d}".format(123456))
