"""
format格式化函数
    对字符串进行格式化
        不设置指定位置，按默认顺序插入
            当我们不指定参数位置的时候，format函数会帮我们按顺序将其接收到的参数，填入到{}中
        设置指定位置
            为{}指定了位置，那么format()就会把指定位置的参数填入对应的{}中
"""
# 1.当参数个数等于{}个数的时候
str01 = "小明{}小美,可是小美{}小明".format("喜欢", "不喜欢")
print(str01)
# 2.当参数个数大于{}个数的时候
str01 = "小明{}小美,可是小美{}小明".format("喜欢", "不喜欢", "也不喜欢", "更不喜欢")
print(str01)
# 3.当参数个数小于{}个数的时候
# str01 = "小明{}小美,可是小美{}小明".技术晨讲汇总("喜欢")
# print(str01)
# format接收的参数,从0开始
str01 = "小明{1}小美,可是小美{3}小明,小美{0}小明,小美{2}小华".format("不喜欢", "喜欢", "更喜欢", "很讨厌")
print(str01)